InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<Comment>Трейд Софт - не переносим</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КурсыВалют/Ext/ManagerModule.bsl
Функция ПеревестиВВалюту(ВалютаСуммы, ВалютаРезультата, Сумма, Период) Экспорт
	Если ВалютаСуммы = ВалютаРезультата Тогда
		Возврат Сумма;
	Иначе
	    КурсСуммы = РегистрыСведений.КурсыВалют.СрезПоследних(Период, Новый Структура("Валюта", ВалютаСуммы));
	    КурсРезультата = РегистрыСведений.КурсыВалют.СрезПоследних(Период, Новый Структура("Валюта", ВалютаРезультата));
		Возврат Сумма * КурсСуммы.Курс * КурсРезультата.Кратность / (КурсРезультата.Курс * КурсСуммы.Кратность);
	КонецЕсли;
КонецФункции
